SCHEDULE_22_IB_1_1 = """📅 Расписание для группы 22-ИБ-1-1:

🔼 Верхняя неделя (первая)  
📌 Понедельник  
2 - Организация ЭВМ и вычислительных систем 🔬  
3 - Организация ЭВМ и вычислительных систем 📖  
4 - Физическая культура и спорт 🏅  

📌 Вторник  
1 - Безопасность вычислительных сетей 🔬  
2 - Безопасность вычислительных сетей 🔬  
3 - Теория информации и кодирования 📝  

📌 Среда  
1 - Математические модели в ИБ 📖  
2 - Организация ЭВМ и вычислительных систем 📝  

📌 Четверг  
2 - Компьютерные сети 📖  
3 - Теория информации и кодирования 📖  

📌 Пятница  
2 - Web-технологии 📖  
3 - Безопасность вычислительных сетей 📖  

🔽 Нижняя неделя (вторая)  
📌 Понедельник  
1 - Компьютерные сети 🔬  
2 - Компьютерные сети 🔬  
3 - Математические модели в ИБ 📝  
4 - Физическая культура и спорт 🏅  

📌 Вторник  
🚫 Выходной  

📌 Среда  
1 - Безопасность вычислительных сетей 📖  
2 - Методы научных исследований 📖  

📌 Четверг  
1 - Организация ЭВМ и вычислительных систем 📖  
2 - Web-технологии 🔬  
3 - Web-технологии 🔬  

📌 Пятница  
1 - Методы научных исследований 📝  
2 - Теория информации и кодирования 📝  
"""

SCHEDULE_22_IB_1_2 = """📅 Расписание для группы 22-ИБ-1-1:

🔼 Верхняя неделя (первая)  
📌 Понедельник 
1 - Компьютерные сети 🔬
2 - Компьютерные сети 🔬  
3 - Организация ЭВМ и вычислительных систем 📖  
4 - Физическая культура и спорт 🏅  

📌 Вторник  
1 - Web-технологии 🔬  
2 - Web-технологии 🔬  
3 - Организация ЭВМ и вычислительных систем 🔬  

📌 Среда  
1 - Математические модели в ИБ 📖  
2 - Организация ЭВМ и вычислительных систем 📝  

📌 Четверг  
2 - Компьютерные сети 📖  
3 - Теория информации и кодирования 📖  

📌 Пятница  
1 - Теория информации и кодирования 📝
2 - Web-технологии 📖  
3 - Безопасность вычислительных сетей 📖  

🔽 Нижняя неделя (вторая)  
📌 Понедельник  
2 - Теория информации и кодирования 📝  
3 - Математические модели в ИБ 📝  
4 - Физическая культура и спорт 🏅  

📌 Вторник  
🚫 Выходной  

📌 Среда  
1 - Безопасность вычислительных сетей 📖  
2 - Методы научных исследований 📖  

📌 Четверг  
1 - Организация ЭВМ и вычислительных систем 📖   

📌 Пятница  
1 - Методы научных исследований 📝  
2 - Безопасность вычислительных сетей 🔬
3 - Безопасность вычислительных сетей 🔬
"""


SCHEDULE_22_IB_1_3 = "Расписание для группы 22-ИБ-1-3:\nПонедельник: Информатика\nВторник: Экономика\nСреда: Философия"

NEWS_DATA = """
📰 Последние новости КГТУ:
1. В университете прошла конференция по IT.
2. Открыта регистрация на олимпиаду по программированию.
3. В библиотеку поступили новые книги по искусственному интеллекту.
"""

SESSION_DATA = "📆 Даты сессий:\nЗимняя сессия: 15-30 января\nЛетняя сессия: 1-15 июня"

ADDRESSES_DATA = """
📍 Контактные данные КГТУ:
🏠 Адрес: ул. Иванова, 10
📞 Телефон: +7 (123) 456-78-90
📧 Email: info@kgtu.ru
"""

EXTRA_SCHEDULE_DATA = "🔗 https://t.me/graphon_klgtu_bot"